zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_uart.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

/**
 * @file hw_uart.h
 * @brief UART (通用异步收发器) 硬件寄存器定义
 *
 * 本文件定义了 MSPM0G3507 微控制器中 UART 模块的全部寄存器和位域。
 * UART 提供异步串行通信功能，主要特性包括：
 * - 可配置波特率（整数/小数分频）
 * - 可配置数据格式（数据位/停止位/校验位）
 * - FIFO 缓冲（发送/接收）
 * - DMA 触发支持
 * - LIN 协议支持
 * - IrDA 红外通信支持
 * - 自身地址匹配（多机通信）
 * - 毛刺滤波器
 */

#ifndef ti_devices_msp_peripherals_hw_uart__include
#define ti_devices_msp_peripherals_hw_uart__include

/* Filename: hw_uart.h */
/* Revised: 2023-05-01 11:26:08 */
/* Revision: 04a99860157777ec8b82069fbacd72235a1fb09e */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* UART Registers - UART 寄存器定义
******************************************************************************/

/* 各寄存器组基地址偏移 */
#define UART_DMA_TRIG_TX_OFS                     ((uint32_t)0x00001080U)  /* DMA发送触发寄存器偏移 */
#define UART_DMA_TRIG_RX_OFS                     ((uint32_t)0x00001050U)  /* DMA接收触发寄存器偏移 */
#define UART_CPU_INT_OFS                         ((uint32_t)0x00001020U)  /* CPU中断寄存器偏移 */
#define UART_GPRCM_OFS                           ((uint32_t)0x00000800U)  /* GPRCM寄存器偏移 */


/** @addtogroup UART_DMA_TRIG_TX
  @{
*/

/* DMA 发送触发中断寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001080) 中断索引寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) 屏蔽后中断状态 */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000010A0) 中断置位寄存器 */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x000010A8) 中断清除寄存器 */
} UART_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group UART_DMA_TRIG_TX */

/** @addtogroup UART_DMA_TRIG_RX
  @{
*/

/* DMA 接收触发中断寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) 中断索引寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) 屏蔽后中断状态 */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) 中断置位寄存器 */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) 中断清除寄存器 */
} UART_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group UART_DMA_TRIG_RX */

/** @addtogroup UART_CPU_INT
  @{
*/

/* CPU 中断控制寄存器组 */
typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) 中断索引寄存器 */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) 屏蔽后中断状态 */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) 中断置位寄存器 */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) 中断清除寄存器 */
} UART_CPU_INT_Regs;

/*@}*/ /* end of group UART_CPU_INT */

/** @addtogroup UART_GPRCM
  @{
*/

/* GPRCM (通用电源/复位/时钟控制模块) 寄存器组 */
typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) 电源使能寄存器 */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) 复位控制寄存器 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) 外设时钟配置寄存器 */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) 状态寄存器 */
} UART_GPRCM_Regs;

/*@}*/ /* end of group UART_GPRCM */

