zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_uart.h
/** @addtogroup UART
  @{
*/

/* UART 主寄存器组 - 通用异步收发器功能 */
typedef struct {
       uint32_t RESERVED0[512];
  UART_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) GPRCM寄存器组 */
       uint32_t RESERVED1[506];
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) 时钟分频器 */
       uint32_t RESERVED2;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001008) 超低功耗外设时钟选择 */
       uint32_t RESERVED3[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) 外设调试控制 */
       uint32_t RESERVED4;
  UART_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) CPU中断寄存器 */
       uint32_t RESERVED5;
  UART_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00001050) DMA接收触发寄存器 */
       uint32_t RESERVED6;
  UART_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00001080) DMA发送触发寄存器 */
       uint32_t RESERVED7[13];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) 事件模式 */
  __IO uint32_t INTCTL;                            /* !< (@ 0x000010E4) 中断控制寄存器 */
       uint32_t RESERVED8[6];
  __IO uint32_t CTL0;                              /* !< (@ 0x00001100) UART控制寄存器0（使能/模式） */
  __IO uint32_t LCRH;                              /* !< (@ 0x00001104) 行控制寄存器（数据格式/校验） */
  __I  uint32_t STAT;                              /* !< (@ 0x00001108) 状态寄存器（忙/满/空/错误标志） */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) 中断FIFO级别选择寄存器 */
  __IO uint32_t IBRD;                              /* !< (@ 0x00001110) 波特率整数分频寄存器 */
  __IO uint32_t FBRD;                              /* !< (@ 0x00001114) 波特率小数分频寄存器 */
  __IO uint32_t GFCTL;                             /* !< (@ 0x00001118) 毛刺滤波器控制 */
       uint32_t RESERVED9;
  __IO uint32_t TXDATA;                            /* !< (@ 0x00001120) 发送数据寄存器 */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) 接收数据寄存器 */
       uint32_t RESERVED10[2];
  __IO uint32_t LINCNT;                            /* !< (@ 0x00001130) LIN模式计数器寄存器 */
  __IO uint32_t LINCTL;                            /* !< (@ 0x00001134) LIN模式控制寄存器 */
  __IO uint32_t LINC0;                             /* !< (@ 0x00001138) LIN模式捕获0寄存器 */
  __IO uint32_t LINC1;                             /* !< (@ 0x0000113C) LIN模式捕获1寄存器 */
  __IO uint32_t IRCTL;                             /* !< (@ 0x00001140) IrDA控制寄存器 */
       uint32_t RESERVED11;
  __IO uint32_t AMASK;                             /* !< (@ 0x00001148) 自身地址掩码寄存器 */
  __IO uint32_t ADDR;                              /* !< (@ 0x0000114C) 自身地址寄存器（多机通信） */
       uint32_t RESERVED12[4];
  __IO uint32_t CLKDIV2;                           /* !< (@ 0x00001160) 时钟分频器2 */
} UART_Regs;

/*@}*/ /* end of group UART */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* UART Register Control Bits
******************************************************************************/

/* UART_DMA_TRIG_TX_IIDX Bits */
/* UART_DMA_TRIG_TX_IIDX[STAT] Bits */
#define UART_DMA_TRIG_TX_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define UART_DMA_TRIG_TX_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< UART Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in UARTRIS and UARTMISC. 15h-1Fh
                                                                                    = Reserved */
#define UART_DMA_TRIG_TX_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define UART_DMA_TRIG_TX_IIDX_STAT_TXIFG         ((uint32_t)0x0000000CU)         /* !< UART transmit interrupt; Interrupt
                                                                                    Flag: TX */

/* UART_DMA_TRIG_TX_IMASK Bits */
/* UART_DMA_TRIG_TX_IMASK[TXINT] Bits */
#define UART_DMA_TRIG_TX_IMASK_TXINT_OFS         (11)                            /* !< TXINT Offset */
#define UART_DMA_TRIG_TX_IMASK_TXINT_MASK        ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define UART_DMA_TRIG_TX_IMASK_TXINT_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UART_DMA_TRIG_TX_IMASK_TXINT_SET         ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */

/* UART_DMA_TRIG_TX_RIS Bits */
/* UART_DMA_TRIG_TX_RIS[TXINT] Bits */
#define UART_DMA_TRIG_TX_RIS_TXINT_OFS           (11)                            /* !< TXINT Offset */
#define UART_DMA_TRIG_TX_RIS_TXINT_MASK          ((uint32_t)0x00000800U)         /* !< UART Transmit Interrupt. */
#define UART_DMA_TRIG_TX_RIS_TXINT_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UART_DMA_TRIG_TX_RIS_TXINT_SET           ((uint32_t)0x00000800U)         /* !< Interrupt occured */

/* UART_DMA_TRIG_TX_MIS Bits */
/* UART_DMA_TRIG_TX_MIS[TXINT] Bits */
#define UART_DMA_TRIG_TX_MIS_TXINT_OFS           (11)                            /* !< TXINT Offset */
#define UART_DMA_TRIG_TX_MIS_TXINT_MASK          ((uint32_t)0x00000800U)         /* !< Masked UART Transmit Interrupt. */
#define UART_DMA_TRIG_TX_MIS_TXINT_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UART_DMA_TRIG_TX_MIS_TXINT_SET           ((uint32_t)0x00000800U)         /* !< Interrupt occured */

/* UART_DMA_TRIG_TX_ISET Bits */
/* UART_DMA_TRIG_TX_ISET[TXINT] Bits */
#define UART_DMA_TRIG_TX_ISET_TXINT_OFS          (11)                            /* !< TXINT Offset */
#define UART_DMA_TRIG_TX_ISET_TXINT_MASK         ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define UART_DMA_TRIG_TX_ISET_TXINT_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UART_DMA_TRIG_TX_ISET_TXINT_SET          ((uint32_t)0x00000800U)         /* !< Set Interrupt */

/* UART_DMA_TRIG_TX_ICLR Bits */
/* UART_DMA_TRIG_TX_ICLR[TXINT] Bits */
#define UART_DMA_TRIG_TX_ICLR_TXINT_OFS          (11)                            /* !< TXINT Offset */
#define UART_DMA_TRIG_TX_ICLR_TXINT_MASK         ((uint32_t)0x00000800U)         /* !< Clear UART Transmit Interrupt. */
#define UART_DMA_TRIG_TX_ICLR_TXINT_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UART_DMA_TRIG_TX_ICLR_TXINT_CLR          ((uint32_t)0x00000800U)         /* !< Clear Interrupt */

/* UART_DMA_TRIG_RX_IIDX Bits */
/* UART_DMA_TRIG_RX_IIDX[STAT] Bits */
#define UART_DMA_TRIG_RX_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define UART_DMA_TRIG_RX_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< UART Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in UARTRIS and UARTMISC. 15h-1Fh
                                                                                    = Reserved */
#define UART_DMA_TRIG_RX_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define UART_DMA_TRIG_RX_IIDX_STAT_RTFG          ((uint32_t)0x00000001U)         /* !< UART receive time-out interrupt;
                                                                                    Interrupt Flag: RT; Interrupt
                                                                                    Priority: Highest */
#define UART_DMA_TRIG_RX_IIDX_STAT_RXIFG         ((uint32_t)0x0000000BU)         /* !< UART receive interrupt; Interrupt
                                                                                    Flag: RX */

/* UART_DMA_TRIG_RX_IMASK Bits */
/* UART_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define UART_DMA_TRIG_RX_IMASK_RTOUT_OFS         (0)                             /* !< RTOUT Offset */
#define UART_DMA_TRIG_RX_IMASK_RTOUT_MASK        ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UART_DMA_TRIG_RX_IMASK_RTOUT_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UART_DMA_TRIG_RX_IMASK_RTOUT_SET         ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UART_DMA_TRIG_RX_IMASK[RXINT] Bits */
#define UART_DMA_TRIG_RX_IMASK_RXINT_OFS         (10)                            /* !< RXINT Offset */
#define UART_DMA_TRIG_RX_IMASK_RXINT_MASK        ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define UART_DMA_TRIG_RX_IMASK_RXINT_CLR         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UART_DMA_TRIG_RX_IMASK_RXINT_SET         ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */

/* UART_DMA_TRIG_RX_RIS Bits */
/* UART_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define UART_DMA_TRIG_RX_RIS_RTOUT_OFS           (0)                             /* !< RTOUT Offset */
#define UART_DMA_TRIG_RX_RIS_RTOUT_MASK          ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt. */
#define UART_DMA_TRIG_RX_RIS_RTOUT_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UART_DMA_TRIG_RX_RIS_RTOUT_SET           ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* UART_DMA_TRIG_RX_RIS[RXINT] Bits */
#define UART_DMA_TRIG_RX_RIS_RXINT_OFS           (10)                            /* !< RXINT Offset */
#define UART_DMA_TRIG_RX_RIS_RXINT_MASK          ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define UART_DMA_TRIG_RX_RIS_RXINT_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UART_DMA_TRIG_RX_RIS_RXINT_SET           ((uint32_t)0x00000400U)         /* !< Interrupt occured */

/* UART_DMA_TRIG_RX_MIS Bits */
/* UART_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define UART_DMA_TRIG_RX_MIS_RTOUT_OFS           (0)                             /* !< RTOUT Offset */
#define UART_DMA_TRIG_RX_MIS_RTOUT_MASK          ((uint32_t)0x00000001U)         /* !< Masked UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UART_DMA_TRIG_RX_MIS_RTOUT_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UART_DMA_TRIG_RX_MIS_RTOUT_SET           ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* UART_DMA_TRIG_RX_MIS[RXINT] Bits */
#define UART_DMA_TRIG_RX_MIS_RXINT_OFS           (10)                            /* !< RXINT Offset */
#define UART_DMA_TRIG_RX_MIS_RXINT_MASK          ((uint32_t)0x00000400U)         /* !< Masked UART Receive Interrupt. */
#define UART_DMA_TRIG_RX_MIS_RXINT_CLR           ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define UART_DMA_TRIG_RX_MIS_RXINT_SET           ((uint32_t)0x00000400U)         /* !< Interrupt occured */

