zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_uart.h
/* UART_IFLS Bits */
/* UART_IFLS[TXIFLSEL] Bits */
#define UART_IFLS_TXIFLSEL_OFS                   (0)                             /* !< TXIFLSEL Offset */
#define UART_IFLS_TXIFLSEL_MASK                  ((uint32_t)0x00000007U)         /* !< UART Transmit Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    transmit interrupt are as follows:
                                                                                    Note: for undefined settings the
                                                                                    default configuration is used. */
#define UART_IFLS_TXIFLSEL_LVL_3_4               ((uint32_t)0x00000001U)         /* !< TX FIFO <= 3/4 empty */
#define UART_IFLS_TXIFLSEL_LVL_1_2               ((uint32_t)0x00000002U)         /* !< TX FIFO <= 1/2 empty (default) */
#define UART_IFLS_TXIFLSEL_LVL_1_4               ((uint32_t)0x00000003U)         /* !< TX FIFO <= 1/4 empty */
#define UART_IFLS_TXIFLSEL_LVL_EMPTY             ((uint32_t)0x00000005U)         /* !< TX FIFO is empty */
#define UART_IFLS_TXIFLSEL_LVL_1                 ((uint32_t)0x00000007U)         /* !< TX FIFO >= 1 entry free Note: esp.
                                                                                    required for DMA Trigger */
/* UART_IFLS[RXIFLSEL] Bits */
#define UART_IFLS_RXIFLSEL_OFS                   (4)                             /* !< RXIFLSEL Offset */
#define UART_IFLS_RXIFLSEL_MASK                  ((uint32_t)0x00000070U)         /* !< UART Receive Interrupt FIFO Level
                                                                                    Select  The trigger points for the
                                                                                    receive interrupt are as follows:
                                                                                    Note:    In ULP domain the trigger
                                                                                    levels are used for:   0: LVL_1_4
                                                                                    4: LVL_FULL   For undefined settings
                                                                                    the default configuration is used. */
#define UART_IFLS_RXIFLSEL_LVL_1_4_RES           ((uint32_t)0x00000000U)         /* !< RX FIFO >= 1/4 full Note: For ULP
                                                                                    Domain */
#define UART_IFLS_RXIFLSEL_LVL_1_4               ((uint32_t)0x00000010U)         /* !< RX FIFO >= 1/4 full */
#define UART_IFLS_RXIFLSEL_LVL_1_2               ((uint32_t)0x00000020U)         /* !< RX FIFO >= 1/2 full (default) */
#define UART_IFLS_RXIFLSEL_LVL_3_4               ((uint32_t)0x00000030U)         /* !< RX FIFO >= 3/4 full */
#define UART_IFLS_RXIFLSEL_LVL_FULL_RES          ((uint32_t)0x00000040U)         /* !< RX FIFO is full Note: For ULP
                                                                                    Domain */
#define UART_IFLS_RXIFLSEL_LVL_FULL              ((uint32_t)0x00000050U)         /* !< RX FIFO is full */
#define UART_IFLS_RXIFLSEL_LVL_1                 ((uint32_t)0x00000070U)         /* !< RX FIFO >= 1 entry available Note:
                                                                                    esp. required for DMA Trigger */
/* UART_IFLS[RXTOSEL] Bits */
#define UART_IFLS_RXTOSEL_OFS                    (8)                             /* !< RXTOSEL Offset */
#define UART_IFLS_RXTOSEL_MASK                   ((uint32_t)0x00000F00U)         /* !< UART Receive Interrupt Timeout
                                                                                    Select. When receiving no start edge
                                                                                    for an additional character within
                                                                                    the set bittimes a RX interrupt is
                                                                                    set even if the FIFO level is not
                                                                                    reached. A value of 0 disables this
                                                                                    function. */
#define UART_IFLS_RXTOSEL_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_IFLS_RXTOSEL_MAXIMUM                ((uint32_t)0x00000F00U)         /* !< Highest possible value */

/* UART_IBRD Bits */
/* UART_IBRD[DIVINT] Bits */
#define UART_IBRD_DIVINT_OFS                     (0)                             /* !< DIVINT Offset */
#define UART_IBRD_DIVINT_MASK                    ((uint32_t)0x0000FFFFU)         /* !< Integer Baud-Rate Divisor */
#define UART_IBRD_DIVINT_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_IBRD_DIVINT_MAXIMUM                 ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UART_FBRD Bits */
/* UART_FBRD[DIVFRAC] Bits */
#define UART_FBRD_DIVFRAC_OFS                    (0)                             /* !< DIVFRAC Offset */
#define UART_FBRD_DIVFRAC_MASK                   ((uint32_t)0x0000003FU)         /* !< Fractional Baud-Rate Divisor */
#define UART_FBRD_DIVFRAC_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_FBRD_DIVFRAC_MAXIMUM                ((uint32_t)0x0000003FU)         /* !< Highest possible value */

/* UART_GFCTL Bits */
/* UART_GFCTL[AGFSEL] Bits */
#define UART_GFCTL_AGFSEL_OFS                    (9)                             /* !< AGFSEL Offset */
#define UART_GFCTL_AGFSEL_MASK                   ((uint32_t)0x00000600U)         /* !< Analog Glitch Suppression Pulse
                                                                                    Width This field controls the pulse
                                                                                    width select for the analog glitch
                                                                                    suppression on the RX line. See
                                                                                    device datasheet for exact values. */
#define UART_GFCTL_AGFSEL_AGLIT_5                ((uint32_t)0x00000000U)         /* !< Pulses shorter then 5ns length are
                                                                                    filtered. */
#define UART_GFCTL_AGFSEL_AGLIT_10               ((uint32_t)0x00000200U)         /* !< Pulses shorter then 10ns length are
                                                                                    filtered. */
#define UART_GFCTL_AGFSEL_AGLIT_25               ((uint32_t)0x00000400U)         /* !< Pulses shorter then 25ns length are
                                                                                    filtered. */
#define UART_GFCTL_AGFSEL_AGLIT_50               ((uint32_t)0x00000600U)         /* !< Pulses shorter then 50ns length are
                                                                                    filtered. */
/* UART_GFCTL[AGFEN] Bits */
#define UART_GFCTL_AGFEN_OFS                     (8)                             /* !< AGFEN Offset */
#define UART_GFCTL_AGFEN_MASK                    ((uint32_t)0x00000100U)         /* !< Analog Glitch Suppression Enable */
#define UART_GFCTL_AGFEN_DISABLE                 ((uint32_t)0x00000000U)         /* !< Analog Glitch Filter disable */
#define UART_GFCTL_AGFEN_ENABLE                  ((uint32_t)0x00000100U)         /* !< Analog Glitch Filter enable */
/* UART_GFCTL[DGFSEL] Bits */
#define UART_GFCTL_DGFSEL_OFS                    (0)                             /* !< DGFSEL Offset */
#define UART_GFCTL_DGFSEL_MASK                   ((uint32_t)0x0000003FU)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    RX line.  The value programmed in
                                                                                    this field gives the number of cycles
                                                                                    of functional clock up to which the
                                                                                    glitch has to be suppressed on the RX
                                                                                    line.  In IRDA mode: The minimum
                                                                                    pulse length for receive is given by:
                                                                                    t(MIN) = (DGFSEL) / f(IRTXCLK) */
#define UART_GFCTL_DGFSEL_DISABLED               ((uint32_t)0x00000000U)         /* !< Bypass GF */
#define UART_GFCTL_DGFSEL_MAXIMUM                ((uint32_t)0x0000003FU)         /* !< Highest Possible Value */
/* UART_GFCTL[CHAIN] Bits */
#define UART_GFCTL_CHAIN_OFS                     (11)                            /* !< CHAIN Offset */
#define UART_GFCTL_CHAIN_MASK                    ((uint32_t)0x00000800U)         /* !< Analog and digital noise filters
                                                                                    chaining enable.         0 DISABLE:
                                                                                    When 0, chaining is disabled and only
                                                                                    digital filter output is available to
                                                                                    IP logic for sampling         1
                                                                                    ENABLE: When 1, analog and digital
                                                                                    glitch filters are chained and the
                                                                                    output of the combination is made
                                                                                    available to IP logic for sampling */
#define UART_GFCTL_CHAIN_DISABLED                ((uint32_t)0x00000000U)         /* !< Disabled */
#define UART_GFCTL_CHAIN_ENABLED                 ((uint32_t)0x00000800U)         /* !< Enabled */

